Jmeter_Performance/JMeter-Reports-Solactive/statistics.json
{
  "Ticks" : {
    "transaction" : "Ticks",
    "sampleCount" : 5000,
    "errorCount" : 1994,
    "errorPct" : 39.88,
    "meanResTime" : 4.926000000000014,
    "medianResTime" : 4.0,
    "minResTime" : 0.0,
    "maxResTime" : 26.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 14.0,
    "throughput" : 609.5330976472022,
    "receivedKBytesPerSec" : 62.67940749573327,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 15000,
    "errorCount" : 1994,
    "errorPct" : 13.293333,
    "meanResTime" : 4.965733333333344,
    "medianResTime" : 5.0,
    "minResTime" : 0.0,
    "maxResTime" : 27.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 14.0,
    "throughput" : 1827.7080541001585,
    "receivedKBytesPerSec" : 340.08185181095405,
    "sentKBytesPerSec" : 0.0
  },
  "Statistics" : {
    "transaction" : "Statistics",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.997600000000004,
    "medianResTime" : 5.0,
    "minResTime" : 0.0,
    "maxResTime" : 26.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 14.0,
    "throughput" : 610.3515625,
    "receivedKBytesPerSec" : 125.99790096282959,
    "sentKBytesPerSec" : 0.0
  },
  "Statistics Instrument" : {
    "transaction" : "Statistics Instrument",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.97359999999999,
    "medianResTime" : 5.0,
    "minResTime" : 0.0,
    "maxResTime" : 27.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 11.0,
    "pct3ResTime" : 14.0,
    "throughput" : 610.798924993892,
    "receivedKBytesPerSec" : 152.05445558728317,
    "sentKBytesPerSec" : 0.0
  }
}